#### Terraform Format and Style 🖌`success`
#### dev Terraform Initialization ⚙️`success`
#### dev Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### dev Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mdata.terraform_remote_state.shared_services: Refreshing state...[0m
[0m[1mmodule.linux_web_app.module.app_service.random_string.base: Refreshing state... [id=KlPU][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.random_string.base: Refreshing state... [id=yZQ2][0m
[0m[1mmodule.aks_agw_ingress.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.network_spoke.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus][0m
[0m[1mmodule.boot_diag_storage.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network.azurerm_virtual_network.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.app_service_plan.azurerm_app_service_plan.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus/providers/Microsoft.Web/serverfarms/asp-linux-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.user_assigned_identity.azurerm_user_assigned_identity.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-aks-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.public_ip.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/publicIPAddresses/pip-agw-dev-eastus][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-dev-eastus/providers/Microsoft.Storage/storageAccounts/stdiagdeyzq2eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network_peering_spoke.azurerm_virtual_network_peering.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/virtualNetworkPeerings/vnet-spoke-dev-eastus-to-vnet-transit-hub-shared-services-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network_peering_hub.azurerm_virtual_network_peering.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/virtualNetworkPeerings/vnet-transit-hub-shared-services-eastus-to-vnet-spoke-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.app_service.azurerm_app_service.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus/providers/Microsoft.Web/sites/app-testklpu-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.subnet.azurerm_subnet.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-node-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-agw-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.subnet.azurerm_subnet.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.lb_k8s_master.azurerm_lb.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_1.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/bbb4bf02-0fc9-a6a9-be2c-3c9aebe020b3][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.lb_k8s_node.azurerm_lb.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_3.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/0233663b-e549-8aac-6f4e-73272f925ec0][0m
[0m[1mmodule.aks_agw_ingress.module.aks.azurerm_kubernetes_cluster.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ContainerService/managedClusters/aks-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_0.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/c9eaf8bb-28a1-ac49-25db-3eae7c4daba1][0m
[0m[1mmodule.k8s_cluster.module.lb_backend_address_pool_k8s_master.azurerm_lb_backend_address_pool.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.aks_agw_ingress.module.application_gateway.azurerm_application_gateway.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/applicationGateways/agw-aks-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.lb_backend_address_pool_k8s_node.azurerm_lb_backend_address_pool.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_2.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/applicationGateways/agw-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/58f4caeb-3698-f230-3c26-d9594780700a][0m
[0m[1mmodule.k8s_cluster.module.virtual_machine_k8s_master.azurerm_linux_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-master-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-01-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-00-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.null_resource.aks_config: Refreshing state... [id=3440776425056365020][0m
[0m[1mmodule.aks_agw_ingress.helm_release.ingress_azure: Refreshing state... [id=application-gateway-kubernetes][0m
[0m[1mmodule.aks_agw_ingress.null_resource.aks_test_app: Refreshing state... [id=4963124599666372037][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.k8s_cluster.module.lb_backend_address_pool_k8s_master.azurerm_lb_backend_address_pool.base[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_lb_backend_address_pool" "base" {
      [33m~[0m [0m[1m[0mbackend_ip_configurations[0m[0m = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-00-dev-eastus",
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-01-dev-eastus",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                        = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mload_balancing_rules[0m[0m      = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mloadbalancer_id[0m[0m           = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [1m[0mname[0m[0m                      = "beap-k8s_master"
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m       = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
    }

[1m  # module.k8s_cluster.module.lb_backend_address_pool_k8s_node.azurerm_lb_backend_address_pool.base[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_lb_backend_address_pool" "base" {
      [33m~[0m [0m[1m[0mbackend_ip_configurations[0m[0m = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-00-dev-eastus",
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-01-dev-eastus",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                        = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mload_balancing_rules[0m[0m      = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mloadbalancer_id[0m[0m           = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [1m[0mname[0m[0m                      = "beap-k8s-node"
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m       = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
    }

[1m  # module.k8s_cluster.module.lb_k8s_master.azurerm_lb.base[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_lb" "base" {
      [33m~[0m [0m[1m[0mid[0m[0m                   = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m             = "eastus"
        [1m[0mname[0m[0m                 = "lbi-k8s_master-dev-eastus"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m   = "10.1.3.4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m = [
          [31m-[0m [0m"10.1.3.4",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m  = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
        [1m[0msku[0m[0m                  = "Standard"
      [31m-[0m [0m[1m[0mtags[0m[0m                 = {} [90m->[0m [0m[90mnull[0m[0m

      [33m~[0m [0mfrontend_ip_configuration {
          [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/frontendIPConfigurations/feip-config-lbi-k8s_master" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0minbound_nat_rules[0m[0m             = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mload_balancer_rules[0m[0m           = [] [33m->[0m [0m(known after apply)
            [1m[0mname[0m[0m                          = "feip-config-lbi-k8s_master"
          [33m~[0m [0m[1m[0moutbound_rules[0m[0m                = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.3.4" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_prefix_id[0m[0m           = (known after apply)
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus"
          [31m-[0m [0m[1m[0mzones[0m[0m                         = [] [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # module.k8s_cluster.module.lb_k8s_node.azurerm_lb.base[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_lb" "base" {
      [33m~[0m [0m[1m[0mid[0m[0m                   = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m             = "eastus"
        [1m[0mname[0m[0m                 = "lbi-k8s-node-dev-eastus"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m   = "10.1.3.6" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m = [
          [31m-[0m [0m"10.1.3.6",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m  = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
        [1m[0msku[0m[0m                  = "Standard"
      [31m-[0m [0m[1m[0mtags[0m[0m                 = {} [90m->[0m [0m[90mnull[0m[0m

      [33m~[0m [0mfrontend_ip_configuration {
          [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/frontendIPConfigurations/feip-config-lbi-k8s-node" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0minbound_nat_rules[0m[0m             = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mload_balancer_rules[0m[0m           = [] [33m->[0m [0m(known after apply)
            [1m[0mname[0m[0m                          = "feip-config-lbi-k8s-node"
          [33m~[0m [0m[1m[0moutbound_rules[0m[0m                = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.3.6" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_prefix_id[0m[0m           = (known after apply)
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus"
          [31m-[0m [0m[1m[0mzones[0m[0m                         = [] [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [33m~[0m [0m[1m[0mbackend_address_pool_id[0m[0m = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                      = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master" [33m->[0m [0m(known after apply)
        [1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s_master-00-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_id[0m[0m    = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [33m~[0m [0m[1m[0mbackend_address_pool_id[0m[0m = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                      = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master" [33m->[0m [0m(known after apply)
        [1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s_master-01-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_id[0m[0m    = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [33m~[0m [0m[1m[0mbackend_address_pool_id[0m[0m = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                      = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node" [33m->[0m [0m(known after apply)
        [1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s-node-00-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_id[0m[0m    = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [33m~[0m [0m[1m[0mbackend_address_pool_id[0m[0m = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                      = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node" [33m->[0m [0m(known after apply)
        [1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s-node-01-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_id[0m[0m    = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "bqy3vovbevhulb0uj3lkjktcbb.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [33m~[0m [0m[1m[0mmac_address[0m[0m                   = "00-0D-3A-54-1F-C6" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                          = "nic-lvm-k8s_master-00-dev-eastus"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.3.5" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.1.3.5",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-master-00-dev-eastus" [33m->[0m [0m(known after apply)

      [33m~[0m [0mip_configuration {
            [1m[0mname[0m[0m                          = "ip-nic-lvm-k8s_master-00-dev-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.3.5" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus"
        }
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "bqy3vovbevhulb0uj3lkjktcbb.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
        [1m[0mname[0m[0m                          = "nic-lvm-k8s_master-01-dev-eastus"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.3.7" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.1.3.7",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [33m~[0m [0mip_configuration {
            [1m[0mname[0m[0m                          = "ip-nic-lvm-k8s_master-01-dev-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.3.7" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus"
        }
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "bqy3vovbevhulb0uj3lkjktcbb.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [33m~[0m [0m[1m[0mmac_address[0m[0m                   = "00-0D-3A-54-11-FB" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                          = "nic-lvm-k8s-node-00-dev-eastus"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.4.4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.1.4.4",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-00-dev-eastus" [33m->[0m [0m(known after apply)

      [33m~[0m [0mip_configuration {
            [1m[0mname[0m[0m                          = "ip-nic-lvm-k8s-node-00-dev-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.4.4" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-node-dev-eastus"
        }
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "bqy3vovbevhulb0uj3lkjktcbb.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [33m~[0m [0m[1m[0mmac_address[0m[0m                   = "00-0D-3A-56-AC-1C" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                          = "nic-lvm-k8s-node-01-dev-eastus"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.4.5" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.1.4.5",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-01-dev-eastus" [33m->[0m [0m(known after apply)

      [33m~[0m [0mip_configuration {
            [1m[0mname[0m[0m                          = "ip-nic-lvm-k8s-node-01-dev-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.1.4.5" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-node-dev-eastus"
        }
    }

[1m  # module.k8s_cluster.module.resource_group.azurerm_resource_group.base[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_resource_group" "base" {
      [33m~[0m [0m[1m[0mid[0m[0m       = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m = "eastus"
      [33m~[0m [0m[1m[0mname[0m[0m     = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m     = {} [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_master.azurerm_linux_virtual_machine.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
        [1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
        [1m[0mallow_extension_operations[0m[0m      = true
        [1m[0mcomputer_name[0m[0m                   = "k8s-mast-00-deea"
        [1m[0mdisable_password_authentication[0m[0m = true
      [33m~[0m [0m[1m[0mid[0m[0m                              = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-master-00-dev-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                        = "eastus"
        [1m[0mmax_bid_price[0m[0m                   = -1
        [1m[0mname[0m[0m                            = "lvm-k8s-master-00-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus",
        ] [33m->[0m [0m(known after apply)
        [1m[0mpriority[0m[0m                        = "Regular"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m              = "10.1.3.5" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = [
          [31m-[0m [0m"10.1.3.5",
        ] [33m->[0m [0m(known after apply)
        [1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
        [1m[0msize[0m[0m                            = "Standard_B2s"
      [31m-[0m [0m[1m[0mtags[0m[0m                            = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m              = "919709f1-56d3-42c8-a820-b3a2f39694e0" [33m->[0m [0m(known after apply)
        [1m[0mzone[0m[0m                            = "1"

        admin_ssh_key {
            [1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
            [1m[0musername[0m[0m   = "kuhlmanlabs"
        }

        boot_diagnostics {
            [1m[0mstorage_account_uri[0m[0m = "https://stdiagdeyzq2eastus.blob.core.windows.net/"
        }

      [33m~[0m [0mos_disk {
            [1m[0mcaching[0m[0m                   = "None"
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m              = 30 [33m->[0m [0m(known after apply)
            [1m[0mname[0m[0m                      = "osdisk-lvm-k8s-master-00-dev-eastus"
            [1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
            [1m[0mwrite_accelerator_enabled[0m[0m = false
        }

        source_image_reference {
            [1m[0moffer[0m[0m     = "UbuntuServer"
            [1m[0mpublisher[0m[0m = "Canonical"
            [1m[0msku[0m[0m       = "18.04-LTS"
            [1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
        [1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
        [1m[0mallow_extension_operations[0m[0m      = true
        [1m[0mcomputer_name[0m[0m                   = "k8s-node-00-deea"
        [1m[0mdisable_password_authentication[0m[0m = true
      [33m~[0m [0m[1m[0mid[0m[0m                              = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-00-dev-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                        = "eastus"
        [1m[0mmax_bid_price[0m[0m                   = -1
        [1m[0mname[0m[0m                            = "lvm-k8s-node-00-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus",
        ] [33m->[0m [0m(known after apply)
        [1m[0mpriority[0m[0m                        = "Regular"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m              = "10.1.4.4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = [
          [31m-[0m [0m"10.1.4.4",
        ] [33m->[0m [0m(known after apply)
        [1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
        [1m[0msize[0m[0m                            = "Standard_B2s"
      [31m-[0m [0m[1m[0mtags[0m[0m                            = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m              = "35005280-e3d4-48cd-bfc2-7fdce2a9bff9" [33m->[0m [0m(known after apply)
        [1m[0mzone[0m[0m                            = "1"

        admin_ssh_key {
            [1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
            [1m[0musername[0m[0m   = "kuhlmanlabs"
        }

        boot_diagnostics {
            [1m[0mstorage_account_uri[0m[0m = "https://stdiagdeyzq2eastus.blob.core.windows.net/"
        }

      [33m~[0m [0mos_disk {
            [1m[0mcaching[0m[0m                   = "None"
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m              = 30 [33m->[0m [0m(known after apply)
            [1m[0mname[0m[0m                      = "osdisk-lvm-k8s-node-00-dev-eastus"
            [1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
            [1m[0mwrite_accelerator_enabled[0m[0m = false
        }

        source_image_reference {
            [1m[0moffer[0m[0m     = "UbuntuServer"
            [1m[0mpublisher[0m[0m = "Canonical"
            [1m[0msku[0m[0m       = "18.04-LTS"
            [1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
        [1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
        [1m[0mallow_extension_operations[0m[0m      = true
        [1m[0mcomputer_name[0m[0m                   = "k8s-node-01-deea"
        [1m[0mdisable_password_authentication[0m[0m = true
      [33m~[0m [0m[1m[0mid[0m[0m                              = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-01-dev-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                        = "eastus"
        [1m[0mmax_bid_price[0m[0m                   = -1
        [1m[0mname[0m[0m                            = "lvm-k8s-node-01-dev-eastus"
      [33m~[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus",
        ] [33m->[0m [0m(known after apply)
        [1m[0mpriority[0m[0m                        = "Regular"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m              = "10.1.4.5" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = [
          [31m-[0m [0m"10.1.4.5",
        ] [33m->[0m [0m(known after apply)
        [1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus" [33m->[0m [0m"rg-k8s-cluster-dev-eastus" [31m# forces replacement[0m[0m
        [1m[0msize[0m[0m                            = "Standard_B2s"
      [31m-[0m [0m[1m[0mtags[0m[0m                            = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m              = "92552771-7371-49b9-9757-80199d6456cb" [33m->[0m [0m(known after apply)
        [1m[0mzone[0m[0m                            = "2"

        admin_ssh_key {
            [1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
            [1m[0musername[0m[0m   = "kuhlmanlabs"
        }

        boot_diagnostics {
            [1m[0mstorage_account_uri[0m[0m = "https://stdiagdeyzq2eastus.blob.core.windows.net/"
        }

      [33m~[0m [0mos_disk {
            [1m[0mcaching[0m[0m                   = "None"
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m              = 30 [33m->[0m [0m(known after apply)
            [1m[0mname[0m[0m                      = "osdisk-lvm-k8s-node-01-dev-eastus"
            [1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
            [1m[0mwrite_accelerator_enabled[0m[0m = false
        }

        source_image_reference {
            [1m[0moffer[0m[0m     = "UbuntuServer"
            [1m[0mpublisher[0m[0m = "Canonical"
            [1m[0msku[0m[0m       = "18.04-LTS"
            [1m[0mversion[0m[0m   = "latest"
        }
    }

[0m[1mPlan:[0m 16 to add, 0 to change, 16 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./devtfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./devtfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*